#+options: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:4 todo:t |:t
#+title: DBAT --- The Damped Bundle Adjustment Toolbox for Matlab
#+email: niclas.borlin@cs.umu.se
#+author:
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 25.2.2 (Org mode 9.2.6)
#+latex_class: article
#+latex_class_options:
#+latex_header:
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle: v\dbatversion
#+latex_compiler: pdflatex
#+date: \dbatdate

#+latex_header: \usepackage[round]{natbib}
#+latex_header: \bibliographystyle{abbrvnat}

#+latex_header: \newcommand{\dbatversion}{0.9.1.2}
#+latex_header: \newcommand{\dbatdate}{Dec 09, 2019}

#+latex_header: \setcounter{secnumdepth}{4}

#+latex_header: \usepackage{authblk}
#+latex_header: \author[1]{Niclas Börlin}
#+latex_header: \author[2]{Pierre Grussenmeyer}
#+latex_header: \affil[1]{Department of Computing Science, Ume{\aa} University, Sweden, \texttt{niclas.borlin@cs.umu.se}}
#+latex_header: \affil[2]{ICube Laboratory UMR 7357, Photogrammetry and Geomatics Group, INSA Strasbourg, France, \texttt{pierre.grussenmeyer@insa-strasbourg.fr}}

#+latex_header: \input{preamble.tex}

* lisp                                                             :noexport:
#+begin_src emacs-lisp
  (require 'ox-latex)
  (add-to-list 'org-latex-packages-alist '("cachedir=/tmp/minted" "minted"))

  (unless (file-exists-p "/tmp/minted")
    (mkdir "/tmp/minted"))

  (setq org-latex-listings 'minted)

  (setq org-latex-minted-options
        '(("autogobble,fontsize=\\tiny,frame=single")))

  (setq org-latex-pdf-process
        (mapcar
         (lambda (s)
           (replace-regexp-in-string "%latex -interaction" "%latex -shell-escape -interaction" s))
         org-latex-pdf-process))

  (setq org-latex-toc-command "\\contributions \\newpage \\tableofcontents \\clearpage")
#+end_src

#+RESULTS:
: \contributions \newpage \tableofcontents \clearpage
